Revit 2027 API
ParameterTypeId.SteelElemWeldMainSurfaceshape Property
 "Surface Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainSurfaceshape { get; }
Public Shared ReadOnly Property SteelElemWeldMainSurfaceshape As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainSurfaceshape {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainSurfaceshape : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace